<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [3]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [33]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(id) "Количество вакансий"
                from vacancies 
                '''

df_3_1 = pd.read_sql_query(query_3_1, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\2748927426.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_1 = pd.read_sql_query(query_3_1, connection)

In [5]:
# результат запроса
df_3_1

   Количество вакансий
0                49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''select count(id) "Количество работодателей"
                from employers
                '''

df_3_2 = pd.read_sql_query(query_3_2, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\944207996.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_2 = pd.read_sql_query(query_3_2, connection)

In [7]:
# результат запроса
df_3_2

   Количество работодателей
0                     23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''select count(id) "Количество регионов"
                from areas
                '''

df_3_3 = pd.read_sql_query(query_3_3, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\1098167936.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_3 = pd.read_sql_query(query_3_3, connection)

In [9]:
# результат запроса
df_3_3

   Количество регионов
0                 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''select count(id) "Количество сфер деятельности"
                from industries
                '''

df_3_4 = pd.read_sql_query(query_3_4, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\2841016415.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_4 = pd.read_sql_query(query_3_4, connection)

In [11]:
# результат запроса
df_3_4

   Количество сфер деятельности
0                           294

***

In [12]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = f'''select 
                    a.name area,
                    count(v.id) cnt
                from vacancies v
                left join areas a on v.area_id=a.id
                group by a.id
                order by cnt desc
                '''

df_4_1 = pd.read_sql_query(query_4_1, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\2722925996.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_1 = pd.read_sql_query(query_4_1, connection)

In [14]:
# результат запроса
df_4_1

                         area   cnt
0                      Москва  5333
1             Санкт-Петербург  2851
2                       Минск  2112
3                 Новосибирск  2006
4                      Алматы  1892
..                        ...   ...
764                    Кизляр     1
765                    Джизак     1
766                    Эртиль     1
767                  Арсеньев     1
768  Тура (Красноярский край)     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = f'''select count(v.id) cnt
                from vacancies v
                where (salary_from is not NULL) OR (salary_to is not NULL)
                '''

df_4_2 = pd.read_sql_query(query_4_2, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\1310374392.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_2 = pd.read_sql_query(query_4_2, connection)

In [16]:
# результат запроса
df_4_2

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
# текст запроса
query_4_3 = f'''select 
                    round(AVG(v.salary_from)) AVG,
                    'Нижняя граница' "Граница"
                from vacancies v
                where salary_from is not NULL
                UNION
                select 
                    round(AVG(v.salary_to)) AVG,
                    'Верхняя граница' "Граница"
                from vacancies v
                where salary_to is not NULL
                '''

df_4_3 = pd.read_sql_query(query_4_3, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\1480359422.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_3 = pd.read_sql_query(query_4_3, connection)

In [18]:
# результат запроса
df_4_3

        avg          Граница
0   71065.0   Нижняя граница
1  110537.0  Верхняя граница

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_4_4 = f'''select 
                    v.schedule,
                    v.employment,
                    count(v.employment) cnt
                from vacancies v
                group by v.schedule, v.employment
                order by cnt desc
                '''

df_4_4 = pd.read_sql_query(query_4_4, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\2812949595.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_4 = pd.read_sql_query(query_4_4, connection)

In [20]:
# результат запроса
df_4_4

            schedule           employment    cnt
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_4_5 = f'''select 
                    v.experience,
                    count(v.experience) cnt
                from vacancies v
                group by v.experience
                order by cnt
                '''

df_4_5 = pd.read_sql_query(query_4_5, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\2252803175.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_5 = pd.read_sql_query(query_4_5, connection)

In [22]:
# результат запроса
df_4_5

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [23]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [77]:
# текст запроса
query_5_1 = f'''(select 
                    e.name,
                    count(v.id) cnt,
                    'Первое место' Место
                from vacancies v
                left join EMPLOYERS e on e.id=v.employer_id
                group by e.name
                order by cnt desc
                LIMIT 1)
                UNION ALL
                (select 
                    e.name,
                    count(v.id) cnt,
                    'Пятое место' Место
                from vacancies v
                left join EMPLOYERS e on e.id=v.employer_id
                group by e.name
                order by cnt desc
                OFFSET 4 LIMIT 1)
                '''

df_5_1 = pd.read_sql_query(query_5_1, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\1562926578.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_1 = pd.read_sql_query(query_5_1, connection)

In [78]:
# результат запроса
df_5_1

            name   cnt         Место
0         Яндекс  1933  Первое место
1  Газпром нефть   331   Пятое место

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [100]:
# текст запроса
query_5_2 = f'''select 
                    a.name Регион,
                    count(e.id) "Количество работодателей",
                    count(v.id) "Количество вакансий"
                from areas a
                left join vacancies v on a.id=v.area_id
                left join EMPLOYERS e on a.id=e.area                                
                group by a.id
                HAVING count(v.id) = 0                
                order by count(e.id) DESC
                LIMIT 1
                '''

df_5_2 = pd.read_sql_query(query_5_2, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\1675784025.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_2 = pd.read_sql_query(query_5_2, connection)

In [101]:
# результат запроса
df_5_2

   Регион  Количество работодателей  Количество вакансий
0  Россия                       410                    0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [112]:
# текст запроса
query_5_3 = f'''select 
                    e.name,
                    count(DISTINCT a.id) "Количество регионов"                    
                from EMPLOYERS e
                left join vacancies v on e.id=v.employer_id                
                left join areas a on a.id=v.area_id
                group by e.id         
                order by count(a.id) DESC                
                '''

df_5_3 = pd.read_sql_query(query_5_3, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_31200\1703609224.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_3 = pd.read_sql_query(query_5_3, connection)

In [113]:
# результат запроса
df_5_3

                 name  Количество регионов
0              Яндекс                  181
1          Ростелеком                  152
2            Тинькофф                   43
3                СБЕР                   24
4       Газпром нефть                   24
...               ...                  ...
23496          МАКМАХ                    0
23497   Завод Стелкон                    0
23498        ИнтерЭВМ                    0
23499  Фёдоров Михаил                    0
23500      ИнтерТраст                    0

[23501 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [8]:
# текст запроса
query_5_4 = f'''select count(e.id) "Количество работодателей"                    
                from EMPLOYERS e
                left join EMPLOYERS_INDUSTRIES ei on e.id=ei.employer_id
                Where ei.industry_id is NULL
                '''

df_5_4 = pd.read_sql_query(query_5_4, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_23852\743136717.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_4 = pd.read_sql_query(query_5_4, connection)

In [9]:
# результат запроса
df_5_4

   Количество работодателей
0                      8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [20]:
# текст запроса
query_5_5 = f'''select 
                    e.name "Компания"
                from EMPLOYERS_INDUSTRIES ei
                left join EMPLOYERS e on e.id=ei.employer_id
                group by e.id
                having count(ei.industry_id)=4
                order by e.name
                OFFSET 2 LIMIT 1
                '''

df_5_5 = pd.read_sql_query(query_5_5, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_23852\361232469.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_5 = pd.read_sql_query(query_5_5, connection)

In [21]:
# результат запроса
df_5_5

  Компания
0     2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [28]:
# текст запроса
query_5_6 = f'''select 
                    count(e.id) "Количество работодателей"
                from EMPLOYERS_INDUSTRIES ei
                left join EMPLOYERS e on e.id=ei.employer_id
                left join INDUSTRIES i on i.id=ei.industry_id
                where i.name = 'Разработка программного обеспечения'
                '''

df_5_6 = pd.read_sql_query(query_5_6, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_23852\554279069.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_6 = pd.read_sql_query(query_5_6, connection)

In [29]:
# результат запроса
df_5_6

   Количество работодателей
0                      3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [42]:
# код для получения списка городов-милионников
import urllib.parse as req

path_common = req.urlparse('https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров')
url = path_common.scheme + '://' + req.quote(path_common.netloc) +  req.quote(path_common.path) + '#'+ req.quote(path_common.fragment)

df = pd.read_html(url)[1]
city = list(df['Город'])
city[13] = 'Воронеж'
city = tuple(city) #списка городов-милионников

In [43]:
# текст запроса
query_5_7 = f'''select                     
                    a.name,
                    count(e.id) cnt
                from vacancies v
                left join EMPLOYERS e on e.id=v.employer_id
                left join areas a on a.id=v.area_id
                where (e.name = 'Яндекс') AND (a.name IN {city})
                group by a.id                
                UNION ALL
                select
                    'Total',
                    count(v.id) cnt
                from vacancies v
                left join EMPLOYERS e on e.id=v.employer_id
                left join areas a on a.id=v.area_id
                where (e.name = 'Яндекс') AND (a.name IN {city})                
                order by 2
                '''

df_5_7 = pd.read_sql_query(query_5_7, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_872\1445142209.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_7 = pd.read_sql_query(query_5_7, connection)

In [44]:
# результат запроса
df_5_7

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7            Самара   26
8               Уфа   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

***

In [39]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [83]:
# текст запроса
query_6_1 = f'''select count(v.id)
                from vacancies v
                where (UPPER(v.name) LIKE UPPER('%data%')) OR (UPPER(v.name) LIKE UPPER('%данн%'))
                '''

df_6_1 = pd.read_sql_query(query_6_1, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_10320\4221155369.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_1 = pd.read_sql_query(query_6_1, connection)

In [37]:
# результат запроса
df_6_1

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [53]:
# текст запроса
query_6_2 = f'''select count(*)
                from vacancies v
                where ((name iLIKE '%junior%') OR (experience LIKE '%Нет опыта%')  OR (employment LIKE '%Стажировка%')) AND
                        ((name ilike '%data scientist%') or 
                        (name ilike '%data science%') or 
                        (name ilike '%исследователь данных%') or 
                        (name like '%ML%' and name not ilike '%HTML%') or 
                        (name ilike '%machine learning%') or 
                        (name ilike '%машинн%обучен%'))
                '''

df_6_2 = pd.read_sql_query(query_6_2, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_872\2893566437.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_2 = pd.read_sql_query(query_6_2, connection)

In [54]:
# результат запроса
df_6_2

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [42]:
# текст запроса
query_6_3 = f'''select count(*)
                from vacancies v
                where   ((name ilike '%data scientist%') or 
                        (name ilike '%data science%') or 
                        (name ilike '%исследователь данных%') or 
                        (name like '%ML%' and name not ilike '%HTML%') or 
                        (name ilike '%machine learning%') or 
                        (name ilike '%машинн%обучен%')) and 
                        ((key_skills like '%SQL%') OR (key_skills like '%postgres%'))
                '''

df_6_3 = pd.read_sql_query(query_6_3, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_13788\1713780086.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_3 = pd.read_sql_query(query_6_3, connection)

In [43]:
# результат запроса
df_6_3

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [55]:
# текст запроса
query_6_4 = f'''select count(*)
                from vacancies v
                where   ((name ilike '%data scientist%') or 
                        (name ilike '%data science%') or 
                        (name ilike '%исследователь данных%') or 
                        (name like '%ML%' and name not ilike '%HTML%') or 
                        (name ilike '%machine learning%') or 
                        (name ilike '%машинн%обучен%')) and 
                        (key_skills ilike '%Python%')
                '''

df_6_4 = pd.read_sql_query(query_6_4, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_13788\2422380246.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_4 = pd.read_sql_query(query_6_4, connection)

In [56]:
# результат запроса
df_6_4

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [39]:
# текст запроса
query_6_5 = f'''select round(avg(length(key_skills)-length(replace(key_skills, CHR(9), ''))+1),2) "Количество навыков"
                from vacancies v
                where   ((name ilike '%data scientist%') or 
                        (name ilike '%data science%') or 
                        (name ilike '%исследователь данных%') or 
                        (name like '%ML%' and name not ilike '%HTML%') or 
                        (name ilike '%machine learning%') or 
                        (name ilike '%машинн%обучен%')) and (key_skills is not null) 
                '''

df_6_5 = pd.read_sql_query(query_6_5, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_10388\3444891372.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_5 = pd.read_sql_query(query_6_5, connection)

In [40]:
# результат запроса
df_6_5

   Количество навыков
0                6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [38]:
# текст запроса
query_6_6 = f'''select 
                        v.experience,                        
                        round(AVG(coalesce((v.salary_from+v.salary_to)/2,v.salary_from,v.salary_to,0)))
                from vacancies v
                where   ((name ilike '%data scientist%') or 
                        (name ilike '%data science%') or 
                        (name ilike '%исследователь данных%') or 
                        (name like '%ML%' and name not ilike '%HTML%') or 
                        (name ilike '%machine learning%') or 
                        (name ilike '%машинн%обучен%'))
                        AND ((v.salary_from IS NOT NULL) OR (v.salary_to IS NOT NULL))
                group by v.experience
                
                '''

df_6_6 = pd.read_sql_query(query_6_6, connection)

C:\Users\glaz\AppData\Local\Temp\ipykernel_10532\208748900.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_6 = pd.read_sql_query(query_6_6, connection)

In [39]:
# результат запроса
df_6_6

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

In [52]:
# выводы по предметному анализу

# Общий вывод по проекту

In [53]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования